SPedt_!/src/Documents/ПоступлениеЗаказаПочтыРоссии/ПоступлениеЗаказаПочтыРоссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеЗаказаПочтыРоссии</name>
  <registerRecords>AccumulationRegister.ЗаказыТранспортныхКомпанийОплаты</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыТранспортныхКомпаний</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.ЗаказыТК</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадбавкаПунктаВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

SPedt_!/src/AccumulationRegisters/ЗаказыТранспортныхКомпаний/ЗаказыТранспортныхКомпаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыТранспортныхКомпаний</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.ЗаказыТК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.ТранспортныеКомпании</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/Documents/ПоступлениеЗаказаПочтыРоссии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//ЗаполнитьЗаказ();     
		
	// регистр ЗаказыТранспортныхКомпаний Приход
	Движения.ЗаказыТранспортныхКомпаний.Записывать = Истина;
	Движение = Движения.ЗаказыТранспортныхКомпаний.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.ТранспортнаяКомпания = Справочники.ТранспортныеКомпании.ПочтаРоссии;
	Движение.Количество = 1;
	Движение.Сумма = СтоимостьДоставки;  
	
	Движения.ЗаказыТранспортныхКомпанийОплаты.Записывать = Истина;
	Движение = Движения.ЗаказыТранспортныхКомпанийОплаты.Добавить();
	Движение.ВидОплаты = ВидОплаты;
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.ТранспортнаяКомпания = Справочники.ТранспортныеКомпании.ПочтаРоссии;
	Движение.Количество = 1;
	Движение.Сумма = СтоимостьИтого;
	


КонецПроцедуры

Процедура ЗаполнитьЗаказ()
	Если ЗначениеЗаполнено(НомерЗаказа) и не ЗначениеЗаполнено(Заказ) Тогда
		ЗаказСсылка = справочники.ЗаказыТК.НайтиПоКоду(НомерЗаказа);	
		Если ЗначениеЗаполнено(ЗаказСсылка) Тогда
			Заказ = ЗаказСсылка;
		Иначе	
			ЗаказОб = справочники.ЗаказыТК.СоздатьЭлемент();
			ЗаказОб.Владелец = Справочники.ТранспортныеКомпании.ПочтаРоссии;
			ЗаказОб.Код = НомерЗаказа;
			ЗаказОб.Наименование = "ПР " + НомерЗаказа;
			Попытка
				ЗаказОб.Записать();
				Заказ = ЗаказОб.Ссылка;
			Исключение
				ТекстОшибки = ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НомерЗаказа) и ЗначениеЗаполнено(Заказ) и  НомерЗаказа <> Заказ.Код	Тогда
		ЗаказОб = Заказ.ПолучитьОбъект();
		ЗаказОб.Код = НомерЗаказа;
		ЗаказОб.Наименование = "ПР " + НомерЗаказа;
		Попытка
			ЗаказОб.Записать();
			Заказ = ЗаказОб.Ссылка;
		Исключение
		КонецПопытки;
		
		
	КонецЕсли;	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЗаполнитьЗаказ();
	Если не ЗначениеЗаполнено(Заказ) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен заказ!");
		
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры
